huskyroboticsteam/BLDC_Motor_Board_PY2023/BLDC_Motor_Board.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "HALL1.h"
#include "HALL1_aliases.h"
#include "UH.h"
#include "UH_aliases.h"
#include "UL.h"
#include "UL_aliases.h"
#include "VH.h"
#include "VH_aliases.h"
#include "VL.h"
#include "VL_aliases.h"
#include "WH.h"
#include "WH_aliases.h"
#include "WL.h"
#include "WL_aliases.h"
#include "HALL2.h"
#include "HALL2_aliases.h"
#include "HALL3.h"
#include "HALL3_aliases.h"
#include "RX_1.h"
#include "RX_1_aliases.h"
#include "TX_1.h"
#include "TX_1_aliases.h"
#include "CAN.h"
#include "UART.h"
#include "UART_SPI_UART.h"
#include "UART_PINS.h"
#include "UART_SPI_UART_PVT.h"
#include "UART_PVT.h"
#include "UART_BOOT.h"
#include "ERROR_LED.h"
#include "ERROR_LED_aliases.h"
#include "DEBUG_LED.h"
#include "DEBUG_LED_aliases.h"
#include "Current_Sensor_I2C.h"
#include "Current_Sensor_I2C_I2C.h"
#include "Current_Sensor_I2C_PINS.h"
#include "Current_Sensor_I2C_I2C_PVT.h"
#include "Current_Sensor_I2C_PVT.h"
#include "Current_Sensor_I2C_BOOT.h"
#include "CAN_LED.h"
#include "CAN_LED_aliases.h"
#include "Address_Register.h"
#include "DRV_EN.h"
#include "DRV_EN_aliases.h"
#include "TMC6100.h"
#include "TMC6100_SPI_UART.h"
#include "TMC6100_PINS.h"
#include "TMC6100_SPI_UART_PVT.h"
#include "TMC6100_PVT.h"
#include "TMC6100_BOOT.h"
#include "DIP_1.h"
#include "DIP_1_aliases.h"
#include "Timer_Rotor_Delay.h"
#include "isr_Hall.h"
#include "Pin_Limit_2.h"
#include "Pin_Limit_2_aliases.h"
#include "Pin_Limit_1.h"
#include "Pin_Limit_1_aliases.h"
#include "Clock_2.h"
#include "FAULT.h"
#include "FAULT_aliases.h"
#include "Cur_Alert_1.h"
#include "Cur_Alert_1_aliases.h"
#include "Cur_Alert_2.h"
#include "Cur_Alert_2_aliases.h"
#include "Cur_Alert_3.h"
#include "Cur_Alert_3_aliases.h"
#include "isr_Limit_1.h"
#include "Limit_Register.h"
#include "Timer_Period_Reset.h"
#include "isr_Period_Reset.h"
#include "DIP_2.h"
#include "DIP_2_aliases.h"
#include "DIP_3.h"
#include "DIP_3_aliases.h"
#include "DIP_4.h"
#include "DIP_4_aliases.h"
#include "CAN_isr.h"
#include "CAN_HFCLK.h"
#include "UART_SCBCLK.h"
#include "UART_tx.h"
#include "UART_tx_aliases.h"
#include "UART_rx.h"
#include "UART_rx_aliases.h"
#include "Current_Sensor_I2C_SCBCLK.h"
#include "Current_Sensor_I2C_sda.h"
#include "Current_Sensor_I2C_sda_aliases.h"
#include "Current_Sensor_I2C_scl.h"
#include "Current_Sensor_I2C_scl_aliases.h"
#include "Current_Sensor_I2C_SCB_IRQ.h"
#include "TMC6100_SCBCLK.h"
#include "TMC6100_ss_s.h"
#include "TMC6100_ss_s_aliases.h"
#include "TMC6100_miso_s.h"
#include "TMC6100_miso_s_aliases.h"
#include "TMC6100_sclk_s.h"
#include "TMC6100_sclk_s_aliases.h"
#include "TMC6100_mosi_s.h"
#include "TMC6100_mosi_s_aliases.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyDMA.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

